ЕРПУХАстенд.cbr_Основной/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6b652820-7672-43f5-a265-2bed82a309a6">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="6cc3a6d7-54b4-4e21-af19-24297ed6494a">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="83b54fd4-b18d-4dfc-aa84-3391845a4e5b">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a24a1454-023d-4c52-b65c-48eac9aa6b26">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ПриходныйОрдерНаТовары/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//++ СкребковЮМ 10.02.26 СКЛ.19
Функция cbr_СоздатьПриходныйОрдерИзДвиженияПродукцииИМатериалов(ДвижениеПродукции, Распоряжение, Помещение) Экспорт

	Результат = Неопределено;
	
	ОрдерСсылка = cbr_ПолучитьПриходныйОрдерПоРаспоряжениюПомещению(Распоряжение, Помещение);
	
	Если ОрдерСсылка <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериалов.Отправитель КАК Отправитель,
	|	ДвижениеПродукцииИМатериалов.Получатель КАК Получатель,
	|	ДвижениеПродукцииИМатериалов.Дата КАК Дата,
	|	ДвижениеПродукцииИМатериалов.Номер КАК Номер,
	|	ДвижениеПродукцииИМатериалов.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|		ПО ДвижениеПродукцииИМатериалов.Получатель = СкладскиеЯчейки.Владелец
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДвижениеПродукции);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();

	Если Не Выборка.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ЗонаПриемки = cbr_ПолучитьСкладскуюЯчейку(Выборка.Получатель);
	
	Основание = Новый Структура;
	Основание.Вставить("Распоряжение",				Распоряжение);
	Основание.Вставить("Отправитель",				Выборка.Отправитель);
	Основание.Вставить("Склад",						Выборка.Получатель);
	Основание.Вставить("Помещение",					Помещение);
	Основание.Вставить("ЗонаПриемки",				ЗонаПриемки);	
	Основание.Вставить("ДатаВходящегоДокумента",	Выборка.Дата);
	Основание.Вставить("НомерВходящегоДокумента",	Выборка.Номер);
	Основание.Вставить("ДатаПоступления",			ТекущаяДатаСеанса());
	Основание.Вставить("ХозяйственнаяОперация",		Выборка.ХозяйственнаяОперация);
	
	ПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	ПриходныйОрдер.Заполнить(Основание);
	
	Если ПриходныйОрдер.Товары.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при создании документа ""Приходный ордер на товары"" по распоряжению %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Распоряжение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Результат;
	КонецЕсли;

	ПриходныйОрдер.Дата = ТекущаяДатаСеанса();
	ПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;

	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ПриходныйОрдер,
		Документы.ПриходныйОрдерНаТовары));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ПриходныйОрдер, ПараметрыУказанияСерий);

	Ошибка = Ложь;
	ОписаниеОшибки = "";
	
	Попытка
		ПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);
		Результат = ПриходныйОрдер.Ссылка;
	Исключение
		Ошибка = Истина;
		ОписаниеОшибки = ИнформацияОбОшибке();
	КонецПопытки;

	Если Не Ошибка Тогда
		ТекстСообщения = НСтр("ru = 'Создан и проведен документ %1'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка проведения документа ""Приходный ордер на товары"" по распоряжению %1'");
		ЗаписьЖурналаРегистрации("ОшибкаВыполнения", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.ПриходныйОрдерНаТовары, , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ОписаниеОшибки));
	КонецЕсли;
	
	Если Не Ошибка Тогда
		ТекстСообщения = СтрШаблон(ТекстСообщения, ПриходныйОрдер.Ссылка);
	Иначе
		ТекстСообщения = СтрШаблон(ТекстСообщения, Распоряжение);
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ПриходныйОрдер.Ссылка);

	Возврат Результат;

КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ СкребковЮМ 10.02.26 СКЛ.19
Функция cbr_ПолучитьПриходныйОрдерПоРаспоряжениюПомещению(Распоряжение, Помещение)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	|	ПриходныйОрдерНаТовары.Проведен
	|	И ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение
	|	И ПриходныйОрдерНаТовары.Помещение = &Помещение";

	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Запрос.УстановитьПараметр("Помещение", Помещение);

	РезультатЗапроса = Запрос.Выполнить();
	
	ПриходныеОрдера = РезультатЗапроса.Выгрузить();
	
	Если ПриходныеОрдера.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат ПриходныеОрдера[0].Ссылка;
	
КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19

//++ СкребковЮМ 10.02.26 СКЛ.19
Функция cbr_ПолучитьСкладскуюЯчейку(Склад)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СкладскиеЯчейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
		|ГДЕ
		|	СкладскиеЯчейки.Владелец = &Склад
		|	И СкладскиеЯчейки.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Приемка)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СкладскиеЯчейки = РезультатЗапроса.Выгрузить();
	
	Если СкладскиеЯчейки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Возврат СкладскиеЯчейки[0].Ссылка;
			
КонецФункции //-- СкребковЮМ 10.02.26 СКЛ.19

#КонецОбласти

#КонецЕсли
